math251/three_one.tex
% Created 2024-10-18 Fri 09:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{Three One}
\hypersetup{
 pdfauthor={},
 pdftitle={Three One},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

A vector is characterized by 2 quantities, length and direction. Geometrically a vector in the plane is represented by a direct line segments with its initial point at the origin and its terminal point (x,y). We will consider vectors as objects of Vector spaces.

By R\textsuperscript{n} we mean all vectors with n componenets, and in each component is a real number.
\section{Alternative Notation for Vectors}
\label{sec:org7187a6c}
Comma delimited form v = (v\textsubscript{1},v\textsubscript{2},v\textsubscript{3},\ldots{}v\textsubscript{n})
Row-vector form v = [v\textsubscript{1} v\textsubscript{2} v\textsubscript{3} \ldots{} v\textsubscript{n}]
Column vector form \(\begin{bmatrix}v_{1}\\v_{2}\\v_{3}\\...\\v_{n}\end{bmatrix}\)
\subsection{Facts}
\label{sec:org103e18a}
\begin{itemize}
\item Vectors with the same length and directions are equivalent
\item Zero vector, inital and terminal points coincide
\item Parallel and colinear mean the same thing when applied to vectors
\begin{itemize}
\item colinear = One vector is a multiple of the other
\end{itemize}
\item Vectors whose inital point is not at the origin:
\begin{itemize}
\item P\textsubscript{1}P\textsubscript{2}\textsuperscript{\(\Rightarrow\)} denotes the initial point P\textsubscript{1}(x\textsubscript{1},y\textsubscript{1}) and terminal point P\textsubscript{2}(x\textsubscript{2},y\textsubscript{2}). The components are P\textsubscript{1}P\textsubscript{2}\textsuperscript{\(\Rightarrow\)} = (x\textsubscript{2}-x\textsubscript{1},y\textsubscript{2}-y\textsubscript{1})
\end{itemize}
\item The linear combination of vectors v\textsubscript{1},v\textsubscript{2},v\textsubscript{n} is k\textsubscript{1}v\textsubscript{1} + k\textsubscript{2}v\textsubscript{2} + k\textsubscript{n}v\textsubscript{n}, where the k\textsubscript{i}'s are scalars, or real numbers
\end{itemize}
\section{Length (Magnitude)}
\label{sec:org389a8d4}
Sqrt of the sum of each component squared
\section{Unit vector in the same direction}
\label{sec:org378ad29}
\(\frac{u}{||u||}\)
\section{Write vector as a linear combination of (1,0) \& (0,1)}
\label{sec:org1c8abfc}
\(v^{\rightarrow{}} = a \times (1,0) + b \times (0,1)\) for some real numbers a,b
So, \((2,5) = a(1,0) + b(0,1)\), where a = 2, and b = 5
\section{For vectors (1,5,4) and (2,7,-4) find all vectors w such that w can be written as a linear combination of u and v}
\label{sec:orgddf59c8}
\(w = (w_{1},w_{2},w_{3})\)
\(w = a(1,5,4) + b(2,7,-4)\)
\(w_{1} = a+2b\)
\(w_{2} = 5a+7b\)
\(w_{3} = 4a-4b\)
\(\begin{bmatrix}1&2&w_{1}\\5&7&w_{2}\\4&-4&w_{3}\end{bmatrix}\)
\(r_{2}-5r_{1} \rightarrow{} r_{2}\)
\(r_{3}-4r_{1} \rightarrow r_{3}\)
\(\begin{bmatrix}1&2&w_{1}\\0&-3&w_{2}-5w_{1}\\0&-12&w_{3}-4w_{1}\end{bmatrix}\)
\(r_{3}-4r_{2}\rightarrow{}r_{3}\)
\(\begin{bmatrix}1&2&w_{1}\\0&-3&w_{2}-5w_{1}\\0&0&w_{3}-4w_{1}-4(w_{2}-5w_{1})\end{bmatrix}\)
\begin{itemize}
\item To have solution we need to make the RHS of row 3 = 0
\end{itemize}
\(w_{3}-4w_{1}-4(w_{2}-5w_{1}) = 0\)
\(w_{3}+16w_{1}-4w_{2} = 0\)

let y = w\textsubscript{2}, x = w\textsubscript{1}
\(w_{3} = 4y - 16x\)
So, w\textsuperscript{\(\rightarrow\)} = any vector such that (x,y,4y-16x) where x,y \(\in\) \mathbb{R}
\section{Notes}
\label{sec:orgd7be7ef}
Cannot do u*v
\begin{itemize}
\item \(\begin{bmatrix}1&3&4\end{bmatrix} \begin{bmatrix}2&4&6\end{bmatrix}\)
\end{itemize}
Can do u * v\textsuperscript{T}
\begin{itemize}
\item \(\begin{bmatrix}1&3&4\end{bmatrix} \begin{bmatrix}2\\4\\6\end{bmatrix}\)
\end{itemize}
\end{document}
